_org/_posts/2018-12-21-ltsp-scenarios.org
#+TITLE:     LTSP Scenarios
#+AUTHOR:    Dashamir Hoxha
#+EMAIL:     dashohoxha@gmail.com
#+DATE:      2018-12-21
#+OPTIONS:   H:3 num:nil toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:nil LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
# #+INFOJS_OPT: view:overview toc:t ltoc:t mouse:#aadddd buttons:0 path:js/org-info.js
#+STYLE: <link rel="stylesheet" type="text/css" href="css/org-info.css" />

#+begin_comment yaml-front-matter
---
layout:     post
title:      LTSP Scenarios
date:       2018-12-21

summary: LTSP allows computers of a LAN to boot through the network from
  a single server. The benefits of using it are reduced hardware costs and
  reduced time of maintenance (with the later one becoming more important
  over time, as hardware becomes cheaper). It has other benefits as well
  in administration and maintenance. In this article we will see different
  configuration and maintenance scenarios of a LTSP server.

tags:       LTSP Ubuntu
---
#+end_comment

* About LTSP

[[http://www.ltsp.org][LTSP]] allows computers of a LAN to boot through the network from a
single server. The benefits of using it are reduced hardware costs and
reduced time of maintenance.

Hardware costs are reduced because the clients don't need to be
powerful, since everything (or almost everything) runs on the
server. They don't need to have a hard-disk and don't need to have
much RAM.

The time of maintenance is reduced because there is only the server to
be maintained, not 20-30 computers of the LAN. Installing new
software, updating, upgrading etc. is done only once on the server.
The reduced time of maintenance is becoming the most important benefit
of using LTSP, as hardware becomes cheaper.

Besides these, LTSP has other administration and communication
benefits. For example it provides centralized user accounts (a user
can login to his account from any terminal). Or screen/desktop sharing
(for example a teacher can show his desktop to the students for
demonstration, or can see what they are doing, and even help them
remotely).

In this article we will see different configuration and maintenance
scenarios of a LTSP server. These are based on my experience and on
the discussion made on the ltsp-discuss mailing list. It is by no
means a complete or thorough list of all the possible scenarios, so
any suggestions for adding new scenarios to this list would be
welcome.


* Managing User Accounts

User accounts are created and maintained on the server. Any command or
tool will do, but if there are lots of accounts, some bash scripts
would be useful for automating bulk operations. This is such a script:
https://gitlab.com/Virtual-LTSP/VirtualBox/blob/bionic/users.sh

As shown also on its help, you can use it to create new accounts,
export, import, backup and restore user accounts and their home
directories:

#+begin_example
Usage: ./users.sh [<command>] [<filename>]

Commands:

    create [<user-file.txt>]
        Create new user accounts. Each line of the input contains
        a username, unencrypted password, and details, separated by ':'.
        If no file is given than read from stdin.

    export
        Export to stdout username, encrypted password and details
        for all the users.

    import [<user-file.passwd>]
        Import usernames, encrypted passwords and details from the export file.
        If no file is given than read from stdin.

    backup
        Backup home directories and users (username:password:details).
        The backup archive is stored on the directory 'backup/'.

    restore <backup-file.tgz>
        Restore home directories and user accounts from the given backup file.

#+end_example

If you have a Virtual-LTSP server (a LTSP server on VirtualBox, with
Vagrant), you have to login first to the server, for example like this:
#+begin_example
cd ltsp-server/
vagrant ssh
sudo su
cd /hosts/
./users.sh
#+end_example

The backup files are usually stored on the directory ~/hosts/backup/~,
which is a shared directory between the virtualbox machine and its
host. So, in case you have to rebuild the server (=./server.sh build=),
the backup will be available to the new server and you can restore it.


* Maintaining a Chrootless Client Image

The defining feature of a *chrootless* client image is that there is no
/chroot/ directory for its files. Instead, the LTSP server itself is
used as an example or template for the client image. This means that
if we want to update/upgrade or install new software on the client
image, we have to do this on the server itself, and then we have to
regenerate the image of the client (using the command
=ltsp-update-image --cleanup /=).

Sometimes there is a problem, because we want to install on the LTSP
server things that we don't want to run on the client (for example
apache2, mysql, guacamole, etc.).

A solution for this is to exclude from the image some of the
directories and services of the server. There are these options:
- Use the directive =RM_SYSTEM_SERVICES= on
  ~/var/lib/tftpboot/ltsp/i386/lts.conf~ to disable some services even
  if they are installed on the client.
- Use the directive =EXCLUDE= on ~/etc/ltsp/ltsp-build-client.conf~ to
  uninstall some packages from the finished chroot.
- Add lines like =etc/apache2/= on ~/etc/ltsp/ltsp-update-image.excludes~
  to exclude certain directories from the image.
- Use the option =--exclude= of the command =ltsp-update-image= to exclude
  certain directories from the image.
- Create a shell script like ~/etc/ltsp/cleanup.d/60-cleanup~ which is
  executed inside the chroot before generating the image from it. In
  this script you can uninstall packages, remove directories, etc.

Another approach, which is simpler and cleaner (in my opinion), is to
unpack the client image into a directory, chroot into it, make any
necessary maintenance (update, upgrade, install etc.), then generate
again the client image from this /chroot/ directory. This essentially
converts it into a *chroot* client image, but that's OK.

It can be done like this:
#+begin_example
unsquashfs -d /opt/ltsp/i386 /opt/ltsp/images/i386.img
rm /opt/ltsp/i386/etc/resolv.conf
ltsp-chroot -mr

apt update
apt upgrade
apt install joe jove
exit    # from chroot

ltsp-update-image
systemctl restart nbd-server
#+end_example

Some other tips and tricks are available here:
http://wiki.ltsp.org/wiki/Tips_and_Tricks/Maintenance


