_posts/2018-12-21-ltsp-scenarios.html
---
layout:     post
title:      LTSP Scenarios
date:       2018-12-21

summary: LTSP allows computers of a LAN to boot through the network from
  a single server. The benefits of using it are reduced hardware costs and
  reduced time of maintenance (with the later one becoming more important
  over time, as hardware becomes cheaper). It has other benefits as well
  in administration and maintenance. In this article we will see different
  configuration and maintenance scenarios of a LTSP server.

tags:       LTSP Ubuntu
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>LTSP Scenarios</title>
<!-- 2019-01-12 Sat 16:29 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dashamir Hoxha" />
</head>
<body>
<div id="content">
<h1 class="title">LTSP Scenarios</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">About LTSP</a></li>
<li><a href="#sec-2">Managing User Accounts</a></li>
<li><a href="#sec-3">Maintaining a Chrootless Client Image</a></li>
<li><a href="#sec-4">Creating Guest Accounts</a></li>
<li><a href="#sec-5">Desktop Configuration For New Users</a></li>
<li><a href="#sec-6">Reverting User Accounts to Default Configuration</a></li>
<li><a href="#sec-7">Allow Teacher To Use Epoptes From a Fat Client</a></li>
<li><a href="#sec-8">Allow Users To Change The Password From a Fat Client</a></li>
<li><a href="#sec-9">Remote Thin/Fat Client Access for Maintenance or Debugging</a></li>
<li><a href="#sec-10">Running Two LTSP Servers on The Same LAN</a></li>
<li><a href="#sec-11">Having Home Directories on a Separate Server</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">About LTSP</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://www.ltsp.org">LTSP</a> allows computers of a LAN to boot through the network from a
single server. The benefits of using it are reduced hardware costs and
reduced time of maintenance.
</p>

<p>
Hardware costs are reduced because the clients don't need to be
powerful, since everything (or almost everything) runs on the
server. They don't need to have a hard-disk and don't need to have
much RAM.
</p>

<p>
The time of maintenance is reduced because there is only the server to
be maintained, not 20-30 computers of the LAN. Installing new
software, updating, upgrading etc. is done only once on the server.
The reduced time of maintenance is becoming the most important benefit
of using LTSP, as hardware becomes cheaper.
</p>

<p>
Besides these, LTSP has other administration and communication
benefits. For example it provides centralized user accounts (a user
can login to his account from any terminal). Or screen/desktop sharing
(for example a teacher can show his desktop to the students for
demonstration, or can see what they are doing, and even help them
remotely).
</p>

<p>
In this article we will see different configuration and maintenance
scenarios of a LTSP server. These are based on my experience and on
the discussion made on the ltsp-discuss mailing list. It is by no
means a complete or thorough list of all the possible scenarios, so
any suggestions for adding new scenarios to this list would be
welcome.
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Managing User Accounts</h2>
<div class="outline-text-2" id="text-2">
<p>
User accounts are created and maintained on the server. Any command or
tool will do, but if there are lots of accounts, some bash scripts
would be useful for automating bulk operations. This is such a script:
<a href="https://gitlab.com/Virtual-LTSP/VirtualBox/blob/bionic/users.sh">https://gitlab.com/Virtual-LTSP/VirtualBox/blob/bionic/users.sh</a>
</p>

<p>
As shown also on its help, you can use it to create new accounts,
export, import, backup and restore user accounts and their home
directories:
</p>

<pre class="example">
Usage: ./users.sh [&lt;command&gt;] [&lt;filename&gt;]

Commands:

    create [&lt;user-file.txt&gt;]
        Create new user accounts. Each line of the input contains
        a username, unencrypted password, and details, separated by ':'.
        If no file is given than read from stdin.

    export
        Export to stdout username, encrypted password and details
        for all the users.

    import [&lt;user-file.passwd&gt;]
        Import usernames, encrypted passwords and details from the export file.
        If no file is given than read from stdin.

    backup
        Backup home directories and users (username:password:details).
        The backup archive is stored on the directory 'backup/'.

    restore &lt;backup-file.tgz&gt;
        Restore home directories and user accounts from the given backup file.
</pre>

<p>
If you have a Virtual-LTSP server (a LTSP server on VirtualBox, with
Vagrant), you have to login first to the server, for example like this:
</p>
<pre class="example">
cd ltsp-server/
vagrant ssh
sudo su
cd /hosts/
./users.sh
</pre>

<p>
The backup files are usually stored on the directory <code>/hosts/backup/</code>,
which is a shared directory between the virtualbox machine and its
host. So, in case you have to rebuild the server (<code>./server.sh build</code>),
the backup will be available to the new server and you can restore it.
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Maintaining a Chrootless Client Image</h2>
<div class="outline-text-2" id="text-3">
<p>
The defining feature of a <b>chrootless</b> client image is that there is no
<i>chroot</i> directory for its files. Instead, the LTSP server itself is
used as an example or template for the client image. This means that
if we want to update/upgrade or install new software on the client
image, we have to do this on the server itself, and then we have to
regenerate the image of the client (using the command
<code>ltsp-update-image --cleanup /</code>).
</p>

<p>
Sometimes there is a problem, because we want to install on the LTSP
server things that we don't want to run on the client (for example
apache2, mysql, guacamole, etc.).
</p>

<p>
A solution for this is to exclude from the image some of the
directories and services of the server. There are these options:
</p>
<ul class="org-ul">
<li>Use the directive <code>RM_SYSTEM_SERVICES</code> on
<code>/var/lib/tftpboot/ltsp/i386/lts.conf</code> to disable some services even
if they are installed on the client.
</li>
<li>Use the directive <code>EXCLUDE</code> on <code>/etc/ltsp/ltsp-build-client.conf</code> to
uninstall some packages from the finished chroot.
</li>
<li>Add lines like <code>etc/apache2/</code> on <code>/etc/ltsp/ltsp-update-image.excludes</code>
  to exclude certain directories from the image.
</li>
<li>Use the option <code>--exclude</code> of the command <code>ltsp-update-image</code> to exclude
certain directories from the image.
</li>
<li>Create a shell script like <code>/etc/ltsp/cleanup.d/60-cleanup</code> which is
executed inside the chroot before generating the image from it. In
this script you can uninstall packages, remove directories, etc.
</li>
</ul>

<p>
Another approach, which is simpler and cleaner (in my opinion), is to
unpack the client image into a directory, chroot into it, make any
necessary maintenance (update, upgrade, install etc.), then generate
again the client image from this <i>chroot</i> directory. This essentially
converts it into a <b>chroot</b> client image, but that's OK.
</p>

<p>
It can be done like this:
</p>
<pre class="example">
unsquashfs -d /opt/ltsp/i386 /opt/ltsp/images/i386.img
rm /opt/ltsp/i386/etc/resolv.conf
ltsp-chroot -mr

apt update
apt upgrade
apt install joe jove
exit    # from chroot

ltsp-update-image
systemctl restart nbd-server
</pre>

<p>
Some other tips and tricks are available here:
<a href="http://wiki.ltsp.org/wiki/Tips_and_Tricks/Maintenance">http://wiki.ltsp.org/wiki/Tips_and_Tricks/Maintenance</a>
</p>
</div>
</div>
