_org/_posts/2018-12-21-ltsp-scenarios.org
* Creating Guest Accounts

In public computers (e.g. in schools, libraries, universities, etc.)
sometimes it is useful to have guest accounts. This means that the
content of the account is temporary and is erased immediately after
logout (or on login). This is important because it reverts
automatically all the default settings, no matter how much the users
mess with them, therefore minimizing the need for maintenance. It is
also important for the safety of the users, because it ensures that no
open accounts or passwords are left behind.

The approach used in LTSP for creating guest accounts is to create
a user for each different IP, and to reset the content of the home
of this user when he makes a login. It is described on these posts:
- https://sourceforge.net/p/ltsp/mailman/message/27814821/
- http://www.m-opensolutions.com/?p=537
- http://www.m-opensolutions.com/?p=667

We need to add these directives on ~lts.conf~ in order to enable the
guest login button:
#+begin_example
[Default]
LDM_GUESTLOGIN=True
HOSTNAME_BASE="$hostname"
#LDM_AUTOLOGIN=True
#+end_example

This script (which should work on any Ubuntu /bionic/ LTSP server) can
be used to create and configure automatically guest accounts:
https://gitlab.com/Virtual-LTSP/VirtualBox/blob/bionic/ltsp-server/scripts/create-guest-accounts.sh

#+begin_example
#!/bin/bash -x
### Create and config guest accounts.

guest=${1:-guest}
pass=${2:-pass}
hostname=${3:-ltsp}

# create the template/skeleton guest account
groupadd guest --gid=500 -f
adduser $guest --uid=500 --gid=500 \
        --shell=/bin/bash --gecos '' \
        --disabled-password
usermod $guest --password="$(openssl passwd -stdin <<< $pass)"
chown $guest:guest -R /home/$guest

# create the guest accounts
rm -rf /home/guest-accounts/
mkdir -p /home/guest-accounts/
for ip in {1..255}; do
    user="${hostname}${ip}"
    adduser $user --uid=$((500 + $ip)) --gid=500 \
            --home=/home/guest-accounts/$user \
            --shell=/bin/bash --gecos '' \
            --disabled-password
    usermod $user --password="$(openssl passwd -stdin <<< $user)"
done

# create a script that resets a guest account
cat <<EOF > /usr/local/bin/reset-guest-account.sh
#!/bin/bash
user=\$SUDO_USER
[[ \$user =~ ^'$hostname'[0-9]{1,3}\$ ]] || exit 1
cd /home/guest-accounts/\$user || exit 2
rm -rf .* *
rsync -a /home/$guest/ .
chown \$user -R .
EOF
chmod +x /usr/local/bin/reset-guest-account.sh

# allow users of group 'guest' to call the reset script with sudo
cat <<EOF > /etc/sudoers.d/reset-guest-account
# users of group 'guest' can call the reset script without password
%guest  ALL = (root) NOPASSWD: /usr/local/bin/reset-guest-account.sh
EOF

# make sure guest accounts are reset on login
cat <<EOF > /usr/share/ldm/rc.d/S00-guest-sessions
# if username matches the pattern of a guest account
# then call the script that resets the account
echo \$LDM_USERNAME | grep -E '^$hostname[0-9]{1,3}\$' \\
    && ssh -S "\$LDM_SOCKET" "\$LDM_SERVER" 'sudo /usr/local/bin/reset-guest-account.sh'
EOF

### place some limits on guest accounts
sed -i /etc/security/limits.conf -e '/^### custom/,$ d'
cat <<EOF >> /etc/security/limits.conf
### custom
@guest        hard    nproc           1000
 *             hard    core            0
@guest        hard    cpu             2
@guest        hard    maxlogins       1
EOF
#+end_example

Guest accounts are reset on each login, which means that the home
directory is erased and is replaced with the content of the home
directory of the account *guest*. As a result, by customizing the
account *guest* (for example changing the background) we actually
customize all the guest accounts.


* Desktop Configuration For New Users

Sometimes we want to customize the default desktop configuration of
the users (for example change the background, add some apps on desktop
or panel, etc.)

An approach that works for MATE, Gnome, Firefox, etc. is to override
the settings (search on google for "default settings" or "mandatory
settings").  For MATE, you can make your own override file for all
users, like this:
#+begin_example
vi /usr/share/glib-2.0/schemas/60_myown.gschema.override
sudo glib-compile-schemas /usr/share/glib-2.0/schemas/
#+end_example

The override file looks like this:
#+begin_example
[org.mate.panel]
default-layout='redmond'

[org.mate.marco]
button-layout='menu:minimize,maximize,close'
theme='TraditionalOk'
num-workspaces=4

[org.mate.panel.objects.window-list.prefs]
group-windows='auto'
display-all-workspaces=true
move-unminimized-windows=false
#+end_example

Here is an example:
https://git.launchpad.net/sch-scripts/tree/debian/sch-scripts.gsettings-override

Another approach is to create a skeleton user account, for example
*skel*, then to make a symbolic link from ~/etc/skel~ to ~/home/skel~:
#+begin_example
mv /etc/skel /etc/skel.bak
ln -s /home/skel /etc/skel
#+end_example
The configurations that you make to the *skel* user will be applied
automatically to the new user accounts that are created.

*Note:* Be careful with this approach. If some applets don't save the
paths to user home directories relatively, this may lead to
confusion. In this case you should remove these applets and try to
configure them the other way (described above).


* Reverting User Accounts to Default Configuration

It is often useful to revert all the settings of user accounts to
default values, except for the files that they have saved, Firefox
bookmarks, etc.  This minimizes the maintenance time for user
accounts, while allowing the users to play with changing the
preferences and other configuration settings, etc.

It can be done by creating the script
~/opt/ltsp/i386/usr/share/ldm/rc.d/S01-user-sessions~ with a content
like this:
#+begin_example
case "$LDM_USERNAME" in
    user*)
        sh -S "$LDM_SOCKET" "$LDM_SERVER" "cd; find . -mindepth 1 -maxdepth 1 \
            -name '.*' -delete; rsync -a /etc/skel/ ."
        ;;
esac
#+end_example

If you have a *chrootless* client image, then this script should be
saved on the file ~/usr/share/ldm/rc.d/S01-user-sessions~ .

The next step is to run ~ltsp-update-image~ (or ~ltsp-update-image
--cleanup /~ for chrootless image).

If we wanted to use a configuration script like that of guest accounts
it would be like this:
#+begin_example
#!/bin/bash -x

# create a script that resets a user account
cat <<EOF > /usr/local/bin/reset-user-account.sh
#!/bin/bash
user=\$SUDO_USER
[[ \$user =~ ^user.*\$ ]] || exit 1
cd /home/\$user || exit 2
find . -mindepth 1 -maxdepth 1 -name '.*' -delete
rsync -a /etc/skel/ .
chown \$user: -R .
EOF
chmod +x /usr/local/bin/reset-user-account.sh

# allow users of group 'student' to call the reset script with sudo
cat <<EOF > /etc/sudoers.d/reset-user-account
# users of group 'user' can call the reset script without password
%user  ALL = (root) NOPASSWD: /usr/local/bin/reset-user-account.sh
EOF

# make sure user accounts are reset on login
cat <<EOF > /usr/share/ldm/rc.d/S01-user-sessions
# if username matches the pattern of a user account
# then call the script that resets the account
echo \$LDM_USERNAME | grep -E '^user.*\$' \\
    && ssh -S "\$LDM_SOCKET" "\$LDM_SERVER" 'sudo /usr/local/bin/reset-user-account.sh'
EOF
#+end_example


