_org/_posts/2018-12-21-ltsp-scenarios.org
* Allow Teacher To Use Epoptes From a Fat Client

Usually the teacher has access to the desktop of the LTSP server and
can launch Epoptes user interface there. It is important that the
Epoptes UI is launched on the LTSP server, because the Epoptes daemon
is running there.

However, sometimes may not be possible to access the desktop of the
LTSP server. In this case, it is possible to launch Epoptes from a fat
client too. This can be done by using remote apps (which means that
the apps run on the server and their display is on the client). Add
these lines on ~/var/lib/tftpboot/ltsp/i386/lts.conf~:
#+begin_example
[Default]
    REMOTE_APPS=True
    RCFILE_01="sed 's,^Exec=/usr/bin/epoptes,Exec=ltsp-remoteapps dbus-launch epoptes,' -i /usr/share/applications/epoptes.desktop"
#+end_example

Now you can login on a fat client and run this on the terminal:
=ltsp-remoteapps dbus-launch epoptes=

*Note:* Make sure that the user of the teacher is a member of the
*epoptes* group.

For more details see also this:
http://www.epoptes.org/documentation/fat-clients


* Allow Users To Change The Password From a Fat Client

Since user accounts live on the server, usually it is not possible to
change the password from the client. The only way is to ssh to the
server and to change it there, or to run a remote application (meaning
that the application runs on the server) that can change the password.

From the terminal it can be done like this: =ssh -t server passwd=
(which runs the command =passwd= on the server). This may be a bit
confusing because it requires twice the current password, before
asking for the new password.

Another way that is nicer, is to set =REMOTE_APPS=True= in
~/var/lib/tftpboot/ltsp/amd64/lts.conf~ (or
~/var/lib/tftpboot/ltsp/i386/lts.conf~). Then you can run from the
client something like this: =ltsp-remote-apps xfce4-terminal -e passwd=

It is even nicer if you can create this alias (for example in ~.bashrc~
of the users):
#+begin_example
alias passwd='ltsp-remote-apps xfce4-terminal -e passwd'
#+end_example
Instead of =passwd=, you may also call a bash script on the server,
which makes the interaction with the user nicer.

It is also possible to allow users to change the password by using a
GUI application.  You can do something like what is described here for
Epoptes: http://www.epoptes.org/documentation/fat-clients Instead of
=epoptes= you can do it for =gnome-about-me= or =mate-about-me= (or whatever
works on your desktop) and then your users will be able to change
their passwords from the menu, without requiring the terminal or any
other weird things.


* Remote Thin/Fat Client Access for Maintenance or Debugging

Sometimes it is not possible (or feasible) to access physically the
LTSP server and the clients for maintenance or debugging. In this case
you can access the desktop of the LTSP server remotely. This can be
done by:
- X2Go (https://wiki.x2go.org/doku.php)
- Epoptes (http://www.epoptes.org) "remote assistance" feature
  (i.e. reverse VNC)
- VNC and ssh tunneling (http://dashohoxha.fs.al/sshtunnels/)
- Guacamole
  (https://gitlab.com/Virtual-LTSP/VirtualBox/blob/bionic/ltsp-server/scripts/guacamole.sh)

Once you are able to access the desktop of the LTSP server remotely,
you can access the desktop of the clients as well, through the Epoptes
"remote control" feature.

You can also boot up clients remotely from Epoptes, if you have them
organized in groups (see:
http://www.epoptes.org/documentation/groups).  However, for this to
work, WoL (Wake on LAN) has to be enabled on the client BIOS/UEFI.

If you want to check also the boot messages on the client, you can do
it with a virtual machine. For example if you install VirtualBox on
the LTSP server, then you can start a VirtualBox LTSP client with a
script like this:
https://gitlab.com/Virtual-LTSP/VirtualBox/blob/bionic/client.sh A
VirtualBox client may not be exactly the same as a real client (in
terms of hardware etc.), but it is better than nothing.

Instead of a VirtualBox machine, you can use a KVM virtual machine as
well. It should be configured to boot in PXE and the KVM server must
be in same subnet as your LTSP clients. Than you can have a QEMU+SSH
connection using virt-manager, which gives you a graphical access to
the VM.


* Running Two LTSP Servers on The Same LAN

This may be useful for example when you already have an old server
running (lets say based on Ubuntu-16.04), and you want to install and
configure a new one (based on Ubuntu-18.04). You can't shutdown or
throw away the old one, until the new one is prepared and tested.

The most easy way is to avoid running them simultaneously (at the same
time), especially when the DHCP server is inside the LTSP server
itself. In this case you have to do the installation and testing of
the new server when the classroom is not being used (so that you can
shut down the old server and boot up the new one).

However, if you make special configurations for each client on the
DHCP server (based on the MAC addresses of the clients), it is
possible to tell some of them to boot from one LTSP server, and the
others to boot from the other. Then both of the LTSP servers (or all
of them, if there are more than two) can run simultaneously, without
stepping on the toes of each-other.

This kind of configuration (running simultaneously multiple LTSP
servers on the same LAN, each one with its own clients) might be
useful also on cases when you have different kinds of clients on the
LAN, which have different requirements, so you use different servers
to serve them. However, it is better, in general, to build different
client images on the same LTSP server, and to serve them to different
clients based on the clients' MAC addresses.


* Having Home Directories on a Separate Server

If you run more than one LTSP server on the same LAN simultaneously,
it is useful to keep all the user accounts and home directories on the
same server. This means that for at least one of the LTSP servers, the
user accounts will have to be accessed from another server (a different
server than the one that serves the system image).

This can be done by using the directive =LDM_SERVER=10.11.12.13= in
~lts.conf~, which means "use this server for authentication and
/home". It is an easy way to separate the authentication/home server,
from the NBD server which serves =/= (the root filesystem).

Alternatively, ~/home~ can also be shared via NFS with a directive like
this on ~lts.conf~:
#+begin_example
FSTAB_1="server:/home /home nfs defaults,nolock 0 0"
#+end_example
Instead of =server= (which is a name for the LTSP server) you can use
any other server, for example =10.11.12.13=.

*Note:* Using separate servers for the system image and for home
directories, implicitly does a bit of load balancing as well.
