_posts/2018-12-21-ltsp-scenarios.html


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Allow Teacher To Use Epoptes From a Fat Client</h2>
<div class="outline-text-2" id="text-7">
<p>
Usually the teacher has access to the desktop of the LTSP server and
can launch Epoptes user interface there. It is important that the
Epoptes UI is launched on the LTSP server, because the Epoptes daemon
is running there.
</p>

<p>
However, sometimes may not be possible to access the desktop of the
LTSP server. In this case, it is possible to launch Epoptes from a fat
client too. This can be done by using remote apps (which means that
the apps run on the server and their display is on the client). Add
these lines on <code>/var/lib/tftpboot/ltsp/i386/lts.conf</code>:
</p>
<pre class="example">
[Default]
    REMOTE_APPS=True
    RCFILE_01="sed 's,^Exec=/usr/bin/epoptes,Exec=ltsp-remoteapps dbus-launch epoptes,' -i /usr/share/applications/epoptes.desktop"
</pre>

<p>
Now you can login on a fat client and run this on the terminal:
<code>ltsp-remoteapps dbus-launch epoptes</code>
</p>

<p>
<b>Note:</b> Make sure that the user of the teacher is a member of the
<b>epoptes</b> group.
</p>

<p>
For more details see also this:
<a href="http://www.epoptes.org/documentation/fat-clients">http://www.epoptes.org/documentation/fat-clients</a>
</p>
</div>
</div>


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Allow Users To Change The Password From a Fat Client</h2>
<div class="outline-text-2" id="text-8">
<p>
Since user accounts live on the server, usually it is not possible to
change the password from the client. The only way is to ssh to the
server and to change it there, or to run a remote application (meaning
that the application runs on the server) that can change the password.
</p>

<p>
From the terminal it can be done like this: <code>ssh -t server passwd</code>
(which runs the command <code>passwd</code> on the server). This may be a bit
confusing because it requires twice the current password, before
asking for the new password.
</p>

<p>
Another way that is nicer, is to set <code>REMOTE_APPS=True</code> in
<code>/var/lib/tftpboot/ltsp/amd64/lts.conf</code> (or
<code>/var/lib/tftpboot/ltsp/i386/lts.conf</code>). Then you can run from the
client something like this: <code>ltsp-remote-apps xfce4-terminal -e passwd</code>
</p>

<p>
It is even nicer if you can create this alias (for example in <code>.bashrc</code>
of the users):
</p>
<pre class="example">
alias passwd='ltsp-remote-apps xfce4-terminal -e passwd'
</pre>
<p>
Instead of <code>passwd</code>, you may also call a bash script on the server,
which makes the interaction with the user nicer.
</p>

<p>
It is also possible to allow users to change the password by using a
GUI application.  You can do something like what is described here for
Epoptes: <a href="http://www.epoptes.org/documentation/fat-clients">http://www.epoptes.org/documentation/fat-clients</a> Instead of
<code>epoptes</code> you can do it for <code>gnome-about-me</code> or <code>mate-about-me</code> (or whatever
works on your desktop) and then your users will be able to change
their passwords from the menu, without requiring the terminal or any
other weird things.
</p>
</div>
</div>


<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Remote Thin/Fat Client Access for Maintenance or Debugging</h2>
<div class="outline-text-2" id="text-9">
<p>
Sometimes it is not possible (or feasible) to access physically the
LTSP server and the clients for maintenance or debugging. In this case
you can access the desktop of the LTSP server remotely. This can be
done by:
</p>
<ul class="org-ul">
<li>X2Go (<a href="https://wiki.x2go.org/doku.php">https://wiki.x2go.org/doku.php</a>)
</li>
<li>Epoptes (<a href="http://www.epoptes.org">http://www.epoptes.org</a>) "remote assistance" feature
(i.e. reverse VNC)
</li>
<li>VNC and ssh tunneling (<a href="http://dashohoxha.fs.al/sshtunnels/">http://dashohoxha.fs.al/sshtunnels/</a>)
</li>
<li>Guacamole
(<a href="https://gitlab.com/Virtual-LTSP/VirtualBox/blob/bionic/ltsp-server/scripts/guacamole.sh">https://gitlab.com/Virtual-LTSP/VirtualBox/blob/bionic/ltsp-server/scripts/guacamole.sh</a>)
</li>
</ul>

<p>
Once you are able to access the desktop of the LTSP server remotely,
you can access the desktop of the clients as well, through the Epoptes
"remote control" feature.
</p>

<p>
You can also boot up clients remotely from Epoptes, if you have them
organized in groups (see:
<a href="http://www.epoptes.org/documentation/groups">http://www.epoptes.org/documentation/groups</a>).  However, for this to
work, WoL (Wake on LAN) has to be enabled on the client BIOS/UEFI.
</p>

<p>
If you want to check also the boot messages on the client, you can do
it with a virtual machine. For example if you install VirtualBox on
the LTSP server, then you can start a VirtualBox LTSP client with a
script like this:
<a href="https://gitlab.com/Virtual-LTSP/VirtualBox/blob/bionic/client.sh">https://gitlab.com/Virtual-LTSP/VirtualBox/blob/bionic/client.sh</a> A
VirtualBox client may not be exactly the same as a real client (in
terms of hardware etc.), but it is better than nothing.
</p>

<p>
Instead of a VirtualBox machine, you can use a KVM virtual machine as
well. It should be configured to boot in PXE and the KVM server must
be in same subnet as your LTSP clients. Than you can have a QEMU+SSH
connection using virt-manager, which gives you a graphical access to
the VM.
</p>
</div>
</div>


<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Running Two LTSP Servers on The Same LAN</h2>
<div class="outline-text-2" id="text-10">
<p>
This may be useful for example when you already have an old server
running (lets say based on Ubuntu-16.04), and you want to install and
configure a new one (based on Ubuntu-18.04). You can't shutdown or
throw away the old one, until the new one is prepared and tested.
</p>

<p>
The most easy way is to avoid running them simultaneously (at the same
time), especially when the DHCP server is inside the LTSP server
itself. In this case you have to do the installation and testing of
the new server when the classroom is not being used (so that you can
shut down the old server and boot up the new one).
</p>

<p>
However, if you make special configurations for each client on the
DHCP server (based on the MAC addresses of the clients), it is
possible to tell some of them to boot from one LTSP server, and the
others to boot from the other. Then both of the LTSP servers (or all
of them, if there are more than two) can run simultaneously, without
stepping on the toes of each-other.
</p>

<p>
This kind of configuration (running simultaneously multiple LTSP
servers on the same LAN, each one with its own clients) might be
useful also on cases when you have different kinds of clients on the
LAN, which have different requirements, so you use different servers
to serve them. However, it is better, in general, to build different
client images on the same LTSP server, and to serve them to different
clients based on the clients' MAC addresses.
</p>
</div>
</div>


<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Having Home Directories on a Separate Server</h2>
<div class="outline-text-2" id="text-11">
<p>
If you run more than one LTSP server on the same LAN simultaneously,
it is useful to keep all the user accounts and home directories on the
same server. This means that for at least one of the LTSP servers, the
user accounts will have to be accessed from another server (a different
server than the one that serves the system image).
</p>

<p>
This can be done by using the directive <code>LDM_SERVER=10.11.12.13</code> in
<code>lts.conf</code>, which means "use this server for authentication and
/home". It is an easy way to separate the authentication/home server,
from the NBD server which serves <code>/</code> (the root filesystem).
</p>

<p>
Alternatively, <code>/home</code> can also be shared via NFS with a directive like
this on <code>lts.conf</code>:
</p>
<pre class="example">
FSTAB_1="server:/home /home nfs defaults,nolock 0 0"
</pre>
<p>
Instead of <code>server</code> (which is a name for the LTSP server) you can use
any other server, for example <code>10.11.12.13</code>.
</p>

<p>
<b>Note:</b> Using separate servers for the system image and for home
directories, implicitly does a bit of load balancing as well.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-12-21</p>
<p class="author">Author: Dashamir Hoxha</p>
<p class="date">Created: 2019-01-12 Sat 16:29</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
